<!-- Main Footer -->
<footer class="main-footer">
    @if (empty(config('admin.footer_view')))
        @php
            
            $quote = Illuminate\Support\Facades\Cache::remember('today-footer-quote', 60 * 60 * 24, function () {
                $quotes = [
                    [
                        'author' => 'امام علی عليه السلام',
                        'quote' => 'رياكار را سه نشانه است: هرگاه مردم را ببيند، به نشاط مى آيد، هرگاه تنهاست، بى حال و تنبل است، و دوست دارد كه در همه كارهايش، او را ستايش كنند.',
                        'ref' => 'اصول كافى: ج 2، ص 295',
                    ],
                    [
                        'author' => 'امام علی عليه السلام',
                        'quote' => 'نيازهاى مردم به شما، نعمتى از سوى خداوند بر شماست، پس آنها را غنيمت شماريد.',
                        'ref' => 'غررالحكم: ج2، ص537',
                    ],
                    [
                        'author' => 'امام صادق عليه السلام',
                        'quote' => 'هرگاه كسى را دوست داشتى به او خبر بده، چرا كه اين كار، دوستى ميان شما را استوارتر مـى‌سازد.',
                        'ref' => 'اصول كافى: ج 2، ص 644',
                    ],
                    [
                        'author' => 'امام صادق عليه السلام',
                        'quote' => 'هر مردمى را دولتى است كه منتظر فرا رسيدن آن هستند و دولت ما در پايان روزگار، آشكار مى‌شود.',
                        'ref' => 'روضة الواعظين، ص234',
                    ],
                    [
                        'author' => 'امام علی عليه السلام',
                        'quote' => 'هر كس دورى سفر (قيامت) را ياد كند آماده راه گردد.',
                        'ref' => 'نهج البلاغه: ص 1222، حکمت 272',
                    ],
                    [
                        'author' => 'امام رضا عليه السلام',
                        'quote' => 'براى خودتـان بهره‌اى از دنيـا قرار دهـيد، به اينكه خواسته‌هاى دل را از حلال به آن بدهيد، تا حدّى كه مروّت را از بين نبرد و اسراف در آن نباشد، و بدين وسيله، بر كارهاى دين، كمك بجوييد.',
                        'ref' => 'فقه الرضا عليه السلام، ص 337',
                    ],
                    [
                        'author' => 'امام رضا عليه السلام',
                        'quote' => 'راوی:هرگز نديدم كه امام رضا عليه السلام با سخن خود كسى را برنجاند و سخن كسى را قطع كند، تا اينكه سخن خود را تمام بكند، و هرگز حاجت كسى را كه توان اداى آنرا داشت ردّ نمى‌كرد.',
                        'ref' => 'عيون اخبار الرضا علیه السلام: ج2، ص197، ح7',
                    ],
                    [
                        'author' => 'امام صادق عليه السلام',
                        'quote' => 'هرگاه قائم برخيزد، به دادگرى حكم راند و ستم در روزگار او به سر آيد و راه‌ها امن شود و زمين بركت‌هاى خود را بيرون ريزد و هر حقى به صاحبش داده شود.',
                        'ref' => 'كشف الغمة : ج 3 ، ص 255',
                    ],
                    [
                        'author' => 'امام كاظم عليه السلام',
                        'quote' => 'خداوند در زمين بندگانى دارد كه براى برآوردن نيازهاى مردم مى‌كوشند؛ اينان ايمنى يافتگان روز قيامت‌اند.',
                        'ref' => 'کافى : ج 2 ، ص 197',
                    ],
                    [
                        'author' => 'امام على عليه السلام',
                        'quote' => 'بدانيد كه هر كس تقواى الهى درپيش گيرد، خداوند براى او راه خروجى از فتنه ها و نورى در تاريكی‌ها قرار دهد.',
                        'ref' => 'نهج البلاغه : خطبه 183',
                    ],
                    [
                        'author' => 'امام رضا عليه السلام',
                        'quote' => 'مردم دو دسته اند: آن كه [به دنيا] رسيده ولى بسنده نمى كند و كسى كه به دنبال آن است و آن را نمى يابد.',
                        'ref' => 'كشف الغمّة: ج 3، ص 100',
                    ],
                    [
                        'author' => 'پيامبر خدا صلى الله عليه و آله',
                        'quote' => 'دو نعمت است كه ناديده گرفته مى‌شود: امنيّت و سلامت.',
                        'ref' => 'بحار الأنوار : ج78 ، ص 170 ، ح 1',
                    ],
                ];
            
                return $quotes[rand(0, count($quotes) - 1)];
            });
        @endphp

        <div class="marquee">
            <p>
                <span>
                    تهیه شده در استودیو تحول دیجیتال
                    <b><a href="http://bikaraan.ir" target="_blank">بیکران</a></b>
                </span>

                -

                <span>
                    <b>{{ $quote['author'] }}: </b>
                    {{ $quote['quote'] }}
                    <small> [{{ $quote['ref'] }}]</small>
                </span>
            </p>
        </div>
    @else
        @include(config('admin.footer_view'))
    @endif
</footer>
